app/controllers/mailer_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 9) LIMIT 1
---
  def index
    puts "in index.."
    puts "~~~~~~~~ #{params[:id]} ~~~~~~~~~~~~~~"
    @mail_id = Member.find(:first, :conditions => "MemberID = #{params[:id]}")

SELECT `members`.id FROM `members` WHERE (`members`.`name` = BINARY '\'user1\'' AND `members`.id <> 21) LIMIT 1
UPDATE `members` SET `Reqflag` = 'Y' WHERE `id` = 21
---
    def regmem
		puts "in regmem"
		puts params[:memname]
		@mem = Member.find(:first,
								:conditions => "name = '#{params[:memname]}'")
		puts @mem.MemberID
		@mem.update_attribute( :Reqflag,  'Y')